import re

my_str = """2024 Календарь соревнований:
07.04.2024 - Гран При Японии;
21.04.2024 - Гран При Китая"""

my_reg = re.compile(r'\d{2}\.\d{2}\.\d{4}')
match = re.findall(my_reg, my_str)
print(match)

my_str_1 = """Мои номера телефонов: А1 +375(029)6234567; МТС +375(033)3334455"""
my_reg_1 = re.compile(r'Мои номера телефонов: А1 \+375\((\d{1,3})\)(\d{7}); МТС \+375\((\d{1,3})\)(\d{7})')
match_1 = re.findall(my_reg_1, my_str_1)
print(match_1)


my_str_1 = """Мои номера телефонов: А1 +375(029)6234567; МТС +375(033)3334455"""
my_reg_1 = re.compile(r'Мои номера телефонов: А1 \+375\((\d{1,3})\)(\d{7}); МТС \+375\((\d{1,3})\)(\d{7})')
match_1 = re.findall(my_reg_1, my_str_1)
print(match_1)